Мюнцкабинент_30/src/Documents/ПоступлениеДопРасходов/ПоступлениеДопРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДопРасходов</name>
  <comment>Дополнительные расходы: стоимость приобретения альбомов, холдеров и проч.</comment>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <comment>Дополнительные расходы: стоимость приобретения альбомов, холдеров и проч.</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/Documents/ПоступлениеДопРасходов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДополнительныеРасходы Приход
	Движения.ДополнительныеРасходы.Записывать = Истина;
	Движение = Движения.ДополнительныеРасходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Коллекционер = Коллекционер;
	Движение.Сумма = СуммаДокумента;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Коллекционер) Тогда
		Коллекционер = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	

КонецПроцедуры
